華國金融中心
22.6279759,120.2905823
22.628402, 120.292996
22.6283428,120.2929456
//STARBUCKS
<a href="https://www.flaticon.com/free-icons/starbucks" title="Starbucks icons">Starbucks icons created by Freepik - Flaticon</a>

愛河門市(高雄市三民區河東路356號)
22.6336478,120.2840156
22.6336478,120.2862043
駁二誠品門市(高雄市鹽埕區大勇路3號(C4倉庫))
22.6204247,120.2790288
22.6204247,120.2816037

漢神本館B1門市(高雄市前金區成功一路266-1號)
22.6193366,120.2934697
22.6193366,120.2960446

中央公園門市(高雄市前金區五福三路31號)
22.6218185,120.2964765
22.6218185,120.2990514

青年門市(高雄市苓雅區成功一路221號1樓)
22.6177968,120.2934949
22.6177968,120.2960698

七賢門市(高雄市新興區七賢一路291、293號)
22.63396,120.3065007
22.63396,120.3090756

let starbucks = ['24.9559188,121.2247727', '24.9622217,121.2251632', '24.9632358,121.2236023'];

//7-11  分辨資訊 https://www.findcoupon.tw/showroom-1151/store/%E9%AB%98%E9%9B%84%E5%B8%82/%E5%89%8D%E9%87%91%E5%8D%80
7-ELEVEN 前金門市(801高雄市前金區自強二路172號1 樓)
22.6278806,120.2944903
7-ELEVEN 龍客門市(801高雄市前金區大同二路1號)
22.6272791,120.2963722
7-ELEVEn 太華門市(801高雄市前金區成功一路455-1號)
22.6285034,120.2919925
7-ELEVEN 長興門市(801高雄市前金區瑞源路68號)
22.630725,120.297793

7-ELEVEN 新盛門市(801高雄市前金區七賢二路193之1號草江里七賢二路193號193-1193-2號1樓)
22.6328727,120.295299
7-ELEVEN 幸福川門市(801高雄市前金區自強一路149號1樓2樓)
22.6328824,120.2922494
7-ELEVEN 自強門市(801高雄市前金區自強二路39號)
22.6231064,120.2960574
7-ELEVEn 明星門市(800高雄市新興區自立二路146號)
22.6331196,120.2983705
7-ELEVEN 中央公園門市(80145高雄市前金區中山一路11號中央公園站)
22.6249677,120.3009119
7-Eleven美麗島門市(800高雄市新興區中山一路115號美麗島站內)
22.631517,120.3013294
7-ELEVEn 合莊門市(800高雄市新興區六合二路37號)
22.6324366,120.3006621
let seven = ['24.9586524,121.2379985', '24.954309,121.2422496'];

//Family Mart
全家便利商店 高雄錢櫃店(801高雄市前金區六合二路157號)
22.6305232,120.294886
全家便利商店 高雄樂活店(801高雄市前金區中華三路146號中華大樓A室)
22.6310024,120.2955169
全家便利商店 高雄榮安店(801高雄市前金區自強一路60號)
22.63076,120.2933596
全家便利商店 高雄美麗綻店(800高雄市新興區自立二路96號)
22.6314461,120.2989547
全家便利商店 高雄寶成店(801高雄市前金區七賢二路322號)
22.6316569,120.2907072

全家便利商店 高雄中華店(801高雄市前金區中華三路21號)
22.6235143,120.2978471
全家便利商店 高雄瑞華店(801高雄市前金區七賢二路156號)
22.633699,120.296727
全家便利商店 高雄三鳳店(801高雄市前金區中華三路251號)
22.634626,120.2936561


let family = ['24.95377,121.2257566', '24.9584369,121.2259209', '24.9589725,121.2229981', '24.9533966,121.213773', '24.950185,121.2141692'];

//Mcdonalds
麥當勞-高雄五福餐廳(800高雄市新興區五福二路258號)
22.6237085,120.3021506
麥當勞-高雄新大勇餐廳(803高雄市鹽埕區大勇路120號)
22.6252045,120.2849148
麥當勞-高雄家樂福餐廳(807高雄市三民區河東路356號1樓)
22.6342682,120.2858409
麥當勞 高雄建國三店(807高雄市三民區建國三路15-1號)
22.637663,120.301727
麥當勞-高雄大遠百餐廳(802高雄市苓雅區三多四路21號號 b1)
22.6130987,120.3039755


let mcdonalds = ['24.9568913,121.2251955', '24.9545826,121.2233151', '24.9625029,121.2232849', '24.9642443,121.2355612'];

// 24.9568913,121.2251955
// lati = mcdonalds[0].split(',')[0]
// longi = mcdonalds[0].split(',')[1]

// for(let i = 0; i < mcdonalds.length; i++){
//     lati = mcdonalds[i].split(',')[0];   //緯度
//     longi = mcdonalds[i].split(',')[1];  //經度
// }